#+TITLE: Library
#+AUTHOR: Elliot Penson

* Fiction

  - [ ] And Then There Were None by Agatha Christie
  - [ ] Brave New World by Aldous Huxley
  - [ ] Cross Her Heart by Sarah Pinborough
  - [X] Dark Matter by Blake Crouch
  - [X] Dune by Frank Herbert
  - [X] Ender's Game by Orson Scott Card
  - [X] Flowers for Algernon
  - [X] Lost At Sea by Bryan Lee O'Malley
  - [ ] Pride and Prejudice by Jane Austen
  - [X] Red Rising by Pierce Brown
  - [X] Room by Emma Donoghue
  - [X] Speaker for the Dead by Orson Scott Card
  - [ ] Stories of Your Life and Others by Ted Chiang
  - [ ] The Diamond Age by Neal Stephenson
  - [ ] The Fifth Season by N.K. Jemisin
  - [X] The Hitchhiker's Guide to the Galaxy by Douglas Adams
  - [X] The Martian by Andy Weir
  - [X] The Ocean at the End of the Lane by Neil Gaiman

* Non-Fiction

** Business

   - [ ] Founders at Work by Jessica Livingston
   - [ ] Good to Great by James Collins
   - [ ] Zero to One by Peter Thiel

** Computer Science

   - [X] [[file:./clean-code.org][Clean Code by Robert C. Martin]]
   - [ ] Insanely Great by Steven Levy
   - [ ] Peopleware by DeMarco and Lister
   - [X] Land of Lisp by Conrad Barski
   - [ ] The Algorithm Design Manual by Steven Skina
   - [ ] The C Programming Language by Kernighan and Richie
   - [ ] The Mythical Man-Month by Fred Brooks
   - [ ] The Pragmatic Programmer by Andrew Hunt
   - [ ] The Supermen by Charles J. Murray
   - [ ] Zero Bugs and Program Faster by Kate Thompson

** English

   - [ ] The Elements of Style by William Strunk

** Math

   - [ ] Burn Math Class by Jason Wilkes
   - [ ] How to Solve It by G. Polya
   - [X] [[file:naked-statistics.org][Naked Statistics by Charles Wheelan]]
   - [ ] [[file:visual-display-of-quantitative-information.org][The Visual Display of Quantitative Information by Edward Tufte]]

** Poetry

   - [ ] A Book of Luminous Things by Robert Hass
   - [ ] Where the Sidewalk Ends by Shel Silverstein

** Psychology

   - [ ] Flow by Mihaly Csikszentmihalyi
   - [ ] Man's Search for Meaning by Viktor Frankl
   - [ ] Modern Romance by Aziz Ansari
   - [ ] On The Shortness of Life by Seneca
   - [ ] When Breath Becomes Air by Paul Kalanithi

** Religion

   - [X] A Grief Observed by C.S. Lewis
   - [ ] Pond River Ocean Rain by Charles Lattimore Howard
   - [X] The Weight of Glory by C.S. Lewis

** Science

   - [X] Astrophysics for People in a Hurry by Neil deGrasse Tyson
   - [ ] Cosmos by Carl Sagan
   - [ ] Sapiens by Yuval Noah Harari
   - [ ] "Surely You're Joking, Mr. Feynman!" by Richard Feynman

* Schedule

  | Year | Week | Title                                | Done |
  |------+------+--------------------------------------+------|
  | 2018 |   37 | Naked Statistics                     | X    |
  | 2018 |   38 | Dark Matter                          | X    |
  | 2018 |   39 | Lost At Sea                          | X    |
  | 2018 |   40 | "Surely You're Joking, Mr. Feynman!" |      |
  | 2018 |   41 | Zero to One                          |      |
  | 2018 |   42 | Modern Romance                       |      |
  | 2018 |   43 | Flow                                 |      |
  | 2018 |   44 | The Diamond Age                      |      |
  | 2018 |   45 | Peopleware                           |      |
  | 2018 |   46 | Pond River Ocean Rain                |      |
  | 2018 |   47 | Burn Math Class                      |      |
  | 2018 |   48 | The Supermen                         |      |
  | 2018 |   49 | Stories of Your Life and Others      |      |
  | 2018 |   50 |                                      |      |
  | 2018 |   51 |                                      |      |
  | 2018 |   52 |                                      |      |

  What week are we on? Evaluate the following with ~C-c C-c~.

  #+BEGIN_SRC elisp
    (format-time-string "%U")
  #+END_SRC

  #+RESULTS:
  : 40
